app/controllers/students_controller.rb

  def update
    #raise params.inspect
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hoop"], ["updated_at", "2021-06-22 06:30:35.605809"], ["id", 1]]